       >>SOURCE FORMAT FREE

IDENTIFICATION DIVISION.
PROGRAM-ID.    HelloWorld.

PROCEDURE DIVISION.
    DISPLAY "Hello World!".

END PROGRAM HelloWorld.
